//// { order: 0, compiler: { target: 1 } }

// به محل بازی با تایپ‌اسکریپت خوش آمدید.
// اینجا ابزاری برای امتحان و آموزش تایپ‌اسکریپت در مرورگر شماست.
// این ابزار به شما این امکان را می دهد که به سادگی
// قابلیت های تایپ اسکریپت را آزمایش کرده و آموخته‌های خود را با دیگران در میان بگذارید.
// برای فرستادن آزمایش خود به دیگران تنها فرستادن آدرس صفحه آزمایش شما کافیست.

const hello = "سلام";

// در سمت راست شما نتیحه مترجم تایپ‌اسکریپت را می توانید ببیید.
// این یک کد جاوااسکریپت است که در مرورگر یا سرور شما قابل اجراست.

const world = "دنیا";

// در اینجا می توانید شاهد تغیراتی که داده می‌شود مثل تبدیل `const` به `var` باشید.
// این یکی از تغییرات زیادی است که تایپ‌اسکریپت برای قابل اجرا بودن در تمام محیطهای جاوااسکریپت باید انجام دهد.

console.log(hello + " " + world);

// حالا که بیشتر با این ابزار آشنا شدیم می‌توانیم
// بیشتر به امکاناتی که تایپ‌اسکریپت برای راحتی کار با جاوااسکریپت در اختیار ما قرار میدهد آشنا شویم.
// در این قسمت تلاش می کنیم که تا حد امکان کدی شبیه به جاوااسکریپت ولی در تایپ اسکریپت
// بنویسیم که سادگی حرکت به سمت تایپ‌اسکریپت را نشان دهیم.
//
// برای ادامه به پیوند زیر بروید:
//
// example:objects-and-arrays
